<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"1a72bc14edf9161d3ee1939bc3ae157aafbf1a8a57a1302171df79ad9a056ea1","plan_job_ref":"Job Create Terraform plan (DEV) #18 at https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14684589187","plan_out_hash":"0793faebc70809ba4ccd8e5aa3ed4744ad869ee6f0ca0494bef13494e704ed24","plan_hash":"f7ab7192e2e3136c2037399675cfb5e42d4c125f97447e3260b063ffed9c413b","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
With var files: `terraform/dev/dev.tfvars`
<details>
<summary>Plan: 4 to add, 1 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.app_gateway.azurerm_application_gateway.this will be created
+   resource "azurerm_application_gateway" "this" {
+       id                          = (known after apply)
+       location                    = "francecentral"
+       name                        = "openrmscore-dev-gw"
+       private_endpoint_connection = (known after apply)
+       resource_group_name         = "rg-openrmscore-dev"
+       tags                        = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }

+       backend_address_pool {
+           fqdns        = [
+               null,
            ]
+           id           = (known after apply)
+           ip_addresses = (known after apply)
+           name         = "backendPool"
        }

+       backend_http_settings {
+           cookie_based_affinity               = "Disabled"
+           id                                  = (known after apply)
+           name                                = "httpSetting"
+           pick_host_name_from_backend_address = false
+           port                                = 80
+           probe_id                            = (known after apply)
+           protocol                            = "Http"
+           request_timeout                     = 60
+           trusted_root_certificate_names      = []
#            (4 unchanged attributes hidden)
        }

+       frontend_ip_configuration {
+           id                            = (known after apply)
+           name                          = "frontendIpConfig"
+           private_ip_address            = (known after apply)
+           private_ip_address_allocation = "Dynamic"
+           private_link_configuration_id = (known after apply)
+           public_ip_address_id          = (known after apply)
        }

+       frontend_port {
+           id   = (known after apply)
+           name = "frontendPort"
+           port = 80
        }

+       gateway_ip_configuration {
+           id        = (known after apply)
+           name      = "gatewayIpConfig"
+           subnet_id = "************************************************************************************************************************************************************************************"
        }

+       http_listener {
+           frontend_ip_configuration_id   = (known after apply)
+           frontend_ip_configuration_name = "frontendIpConfig"
+           frontend_port_id               = (known after apply)
+           frontend_port_name             = "frontendPort"
+           host_names                     = []
+           id                             = (known after apply)
+           name                           = "httpListener"
+           protocol                       = "Http"
+           ssl_certificate_id             = (known after apply)
+           ssl_profile_id                 = (known after apply)
#            (4 unchanged attributes hidden)
        }

+       request_routing_rule {
+           backend_address_pool_id     = (known after apply)
+           backend_address_pool_name   = "backendPool"
+           backend_http_settings_id    = (known after apply)
+           backend_http_settings_name  = "httpSetting"
+           http_listener_id            = (known after apply)
+           http_listener_name          = "httpListener"
+           id                          = (known after apply)
+           name                        = "rule"
+           redirect_configuration_id   = (known after apply)
+           rewrite_rule_set_id         = (known after apply)
+           rule_type                   = "Basic"
+           url_path_map_id             = (known after apply)
#            (3 unchanged attributes hidden)
        }

+       sku {
+           capacity = 2
+           name     = "Standard_v2"
+           tier     = "Standard_v2"
        }

+       ssl_policy (known after apply)
    }

  # module.app_gateway.azurerm_public_ip.this will be created
+   resource "azurerm_public_ip" "this" {
+       allocation_method       = "Static"
+       ddos_protection_mode    = "VirtualNetworkInherited"
+       fqdn                    = (known after apply)
+       id                      = (known after apply)
+       idle_timeout_in_minutes = 4
+       ip_address              = (known after apply)
+       ip_version              = "IPv4"
+       location                = "francecentral"
+       name                    = "openrmscore-dev-gw-pip"
+       resource_group_name     = "rg-openrmscore-dev"
+       sku                     = "Standard"
+       sku_tier                = "Regional"
    }

  # module.container_app.azurerm_container_app.app will be created
+   resource "azurerm_container_app" "app" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openrmscore-dev-app"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openrmscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       workload_profile_name         = "D4"

+       identity {
+           identity_ids = [
+               "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai",
            ]
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = false
+           custom_domain              = (known after apply)
+           external_enabled           = false
+           fqdn                       = (known after apply)
+           target_port                = 8080
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai"
+           server   = "openrmscoredevacr.azurecr.io"
        }

+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscoredevacr.azurecr.io/openrmscore-frontend:latest"
+               memory            = "2Gi"
+               name              = "frontend"

+               env {
+                   name  = "API_URL"
+                   value = "/openmrs"
                }
+               env {
+                   name  = "SPA_CONFIG_URLS"
+                   value = "/openmrs/spa/config-core_demo.json"
                }
+               env {
+                   name  = "SPA_DEFAULT_LOCALE"
#                    (1 unchanged attribute hidden)
                }
+               env {
+                   name  = "SPA_PATH"
+                   value = "/openmrs/spa"
                }
            }
+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscoredevacr.azurecr.io/openrmscore-backend:latest"
+               memory            = "2Gi"
+               name              = "backend"

+               env {
+                   name        = "OMRS_CONFIG_AUTO_UPDATE_DATABASE"
+                   secret_name = "OMRS-CONFIG-AUTO-UPDATE-DATABASE"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_DATABASE"
+                   secret_name = "OMRS-CONFIG-CONNECTION-DATABASE"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_PASSWORD"
+                   secret_name = "OMRS-CONFIG-CONNECTION-PASSWORD"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_SERVER"
+                   secret_name = "OMRS-CONFIG-CONNECTION-SERVER"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_USERNAME"
+                   secret_name = "OMRS-CONFIG-CONNECTION-USERNAME"
                }
+               env {
+                   name        = "OMRS_CONFIG_CREATE_TABLES"
+                   secret_name = "OMRS-CONFIG-CREATE-TABLES"
                }
+               env {
+                   name        = "OMRS_CONFIG_MODULE_WEB_ADMIN"
+                   secret_name = "OMRS-CONFIG-MODULE-WEB-ADMIN"
                }

+               volume_mounts {
+                   name = "openmrs-data"
+                   path = "/openmrs/data"
                }
            }
+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscoredevacr.azurecr.io/openrmscore-gateway:latest"
+               memory            = "2Gi"
+               name              = "gateway"
            }

+           volume {
+               name         = "openmrs-data"
+               storage_name = "openrmscoredevstorage"
+               storage_type = "AzureFile"
            }
        }
    }

  # module.container_app.azurerm_container_app_environment.this will be created
+   resource "azurerm_container_app_environment" "this" {
+       custom_domain_verification_id    = (known after apply)
+       default_domain                   = (known after apply)
+       docker_bridge_cidr               = (known after apply)
+       id                               = (known after apply)
+       infrastructure_subnet_id         = "**********************************************************************************************************************************************************************************"
+       internal_load_balancer_enabled   = true
+       location                         = "francecentral"
+       log_analytics_workspace_id       = "*************************************************************************************************************************************************************"
+       logs_destination                 = "log-analytics"
+       mutual_tls_enabled               = false
+       name                             = "openrmscore-dev-env"
+       platform_reserved_cidr           = (known after apply)
+       platform_reserved_dns_ip_address = (known after apply)
+       resource_group_name              = "rg-openrmscore-dev"
+       static_ip_address                = (known after apply)
+       tags                             = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       zone_redundancy_enabled          = false

+       workload_profile {
+           maximum_count         = 3
+           minimum_count         = 1
+           name                  = "D4"
+           workload_profile_type = "D4"
        }
    }

  # module.network.azurerm_subnet.this["aca"] will be updated in-place
!~  resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-aca"
        name                                          = "openrmscore-dev-aca"
#        (8 unchanged attributes hidden)

!~      delegation {
            name = "delegation-aca"

!~          service_delegation {
!~              actions = [
-                   "Microsoft.Network/virtualNetworks/subnets/join/action",
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.App/environments"
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+   app_gateway_public_ip = (known after apply)
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #18](https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14684589187)